movingBlock/movingBlock_St0.3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1 0 0);

boundaryField
{
    block
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
    left
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    right
    {
        type            inletOutlet;
        inletValue      uniform (1 0 0);
        value           uniform (1 0 0);
    }
    top
    {
        type            slip;
    }
}


// ************************************************************************* //
